## Series

The first main data type we will learn about for pandas is the Series data type. Let’s import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn’t need to hold numeric data, it can hold any arbitrary Python Object. Let’s explore this concept through some examples:

In [1]:
import numpy as np
import pandas as pd

### 0.0.1 Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [2]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array(my_list)
d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(labels, my_list)

10    a
20    b
30    c
dtype: object

### NumPy Arrays

In [9]:
arr

array([10, 20, 30])

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

### Dictionary

In [12]:
d

{'a': 10, 'b': 20, 'c': 30}

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### 0.1 Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let’s see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [14]:
ser1 = pd.Series([1, 2, 3, 4], index=['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1, 2, 5, 4],index = ['Japan', 'USA', 'Italy', 'Germany' ])
ser2

Japan      1
USA        2
Italy      5
Germany    4
dtype: int64

In [16]:
ser1 + ser2

Germany    6.0
Italy      NaN
Japan      5.0
USA        3.0
USSR       NaN
dtype: float64

Let’s stop here for now and move on to DataFrames, which will expand on the concept of Series! # Great Job!

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let’s use pandas to explore this topic!

In [17]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [18]:
data = [[1,2,3,4], [5,6,7,8], [9,10,11,12],[13,14,15,16],[17,18,19,20]]

In [19]:
df = pd.DataFrame(data, index='A B C D E'.split(), columns=['W', 'X', 'Y', 'Z'])

In [20]:
df

    W   X   Y   Z
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

### 1.1 Selection and Indexing

Let’s learn the various methods to grab data from a DataFrame

In [21]:
df['X']

A     2
B     6
C    10
D    14
E    18
Name: X, dtype: int64

In [22]:
type(df['X'])

pandas.core.series.Series

In [23]:
list(df.columns)

['W', 'X', 'Y', 'Z']

In [24]:
# Pass a list of column names
df[['Y', 'Z']]

    Y   Z
A   3   4
B   7   8
C  11  12
D  15  16
E  19  20

Creating a new column:

In [25]:
df['W'] + df['X'] + df['Y'] + df['Z']

A    10
B    26
C    42
D    58
E    74
dtype: int64

In [26]:
df['new'] = df['W'] + df['X'] + df['Y'] + df['Z']
df['new1'] = [1, 2, 3, 4, 5]

In [27]:
df

    W   X   Y   Z  new  new1
A   1   2   3   4   10     1
B   5   6   7   8   26     2
C   9  10  11  12   42     3
D  13  14  15  16   58     4
E  17  18  19  20   74     5

Removing Columns

In [28]:
df.drop('new', axis=1)

    W   X   Y   Z  new1
A   1   2   3   4     1
B   5   6   7   8     2
C   9  10  11  12     3
D  13  14  15  16     4
E  17  18  19  20     5

In [29]:
df

    W   X   Y   Z  new  new1
A   1   2   3   4   10     1
B   5   6   7   8   26     2
C   9  10  11  12   42     3
D  13  14  15  16   58     4
E  17  18  19  20   74     5

In [30]:
df.drop('new', axis=1, inplace=True)

In [31]:
df

    W   X   Y   Z  new1
A   1   2   3   4     1
B   5   6   7   8     2
C   9  10  11  12     3
D  13  14  15  16     4
E  17  18  19  20     5

In [32]:
df = df.drop('new1', axis=1)
df

    W   X   Y   Z
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

Can also drop rows this way:

In [33]:
df.drop('E')

    W   X   Y   Z
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

Selecting Rows

In [34]:
df.loc['A']

W    1
X    2
Y    3
Z    4
Name: A, dtype: int64

Or select based off of position instead of label

In [35]:
df.iloc[0]

W    1
X    2
Y    3
Z    4
Name: A, dtype: int64

Selecting subset of rows and columns

In [36]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [37]:
df.loc[['A', 'B']]

   W  X  Y  Z
A  1  2  3  4
B  5  6  7  8

In [38]:
df.loc[['A', 'B'], ['W', 'X']]

   W  X
A  1  2
B  5  6

### 1.1.1 Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [39]:
df

    W   X   Y   Z
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

In [40]:
df > 10

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False   True   True
D   True   True   True   True
E   True   True   True   True

In [41]:
df[df > 10]

      W     X     Y     Z
A   NaN   NaN   NaN   NaN
B   NaN   NaN   NaN   NaN
C   NaN   NaN  11.0  12.0
D  13.0  14.0  15.0  16.0
E  17.0  18.0  19.0  20.0

In [42]:
df['Y'] > 10

A    False
B    False
C     True
D     True
E     True
Name: Y, dtype: bool

In [43]:
df[df['Y'] > 10]

    W   X   Y   Z
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

In [44]:
df[df['W'] > 1]['X']

B     6
C    10
D    14
E    18
Name: X, dtype: int64

In [45]:
df[df['Y'] > 10][['W', 'X']]

    W   X
C   9  10
D  13  14
E  17  18

For two conditions you can use | and & with parenthesis:

In [46]:
df[(df['W'] > 12) & (df['Y'] > 15)]

    W   X   Y   Z
E  17  18  19  20

In [47]:
df[(df['W'] > 12) | (df['Y'] > 15)]

    W   X   Y   Z
D  13  14  15  16
E  17  18  19  20

### 1.2 More Index Details

Let’s discuss some more features of indexing, including resetting the index or setting it something else. We’ll also talk about index hierarchy!

In [48]:
df

    W   X   Y   Z
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

In [49]:
# Reset to default 0,1...n index
df.reset_index()

  index   W   X   Y   Z
0     A   1   2   3   4
1     B   5   6   7   8
2     C   9  10  11  12
3     D  13  14  15  16
4     E  17  18  19  20

In [50]:
df

    W   X   Y   Z
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

In [51]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [52]:
df['States'] = newind
df

    W   X   Y   Z States
A   1   2   3   4     CA
B   5   6   7   8     NY
C   9  10  11  12     WY
D  13  14  15  16     OR
E  17  18  19  20     CO

In [53]:
df.set_index('States')

         W   X   Y   Z
States
CA       1   2   3   4
NY       5   6   7   8
WY       9  10  11  12
OR      13  14  15  16
CO      17  18  19  20

In [54]:
df

    W   X   Y   Z States
A   1   2   3   4     CA
B   5   6   7   8     NY
C   9  10  11  12     WY
D  13  14  15  16     OR
E  17  18  19  20     CO

In [55]:
df.set_index('States',inplace=True)
df

         W   X   Y   Z
States
CA       1   2   3   4
NY       5   6   7   8
WY       9  10  11  12
OR      13  14  15  16
CO      17  18  19  20

### 1.3 Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we’ll create a quick example of what a MultiIndexed DataFrame would look like:

In [56]:
# Index Levels

hier_index = [('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [57]:
tuples = [(1, u'red'), (1, u'blue'),(2, u'red'), (2, u'blue')]
pd.MultiIndex.from_tuples(tuples, names=('number', 'color'))

MultiIndex([(1,  'red'),
            (1, 'blue'),
            (2,  'red'),
            (2, 'blue')],
           names=['number', 'color'])

In [58]:
data1 = [[1,2],[3,4],[5,6],[7,8],[9,10],[11,12]]

In [59]:
df = pd.DataFrame(data1, index=hier_index, columns=['A','B'])
df

       A   B
G1 1   1   2
   2   3   4
   3   5   6
G2 1   7   8
   2   9  10
   3  11  12

Now let’s show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [60]:
df.loc['G1']

   A  B
1  1  2
2  3  4
3  5  6

In [61]:
df.loc['G1'].loc[2]

A    3
B    4
Name: 2, dtype: int64

In [62]:
df.index.names = ['Group','Num']
df

            A   B
Group Num
G1    1     1   2
      2     3   4
      3     5   6
G2    1     7   8
      2     9  10
      3    11  12

## Index preservation and Index alignment

#### 1 Index Preservation

Pandas is designed to work with NumPy, any NumPy ufunc will work on pandas Series and DataFrame objects.

Lets start by defining a simple Series and DataFrame

In [63]:
ser = pd.Series([8, 8, 5, 6])
ser

0    8
1    8
2    5
3    6
dtype: int64

In [64]:
type(ser)

pandas.core.series.Series

Applying operation on series

If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object with the indices preserved:

In [65]:
np.exp(ser)

0    2980.957987
1    2980.957987
2     148.413159
3     403.428793
dtype: float64

#### 2 Index Alignment

For binary operations on two Series or DataFrame objects, Pandas will align indices in the process of performing the operation. This is very convenient when working with incomplete data, as we’ll see in some of the examples below.

In [66]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,'New York': 19651127},name='population')

In [67]:
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [68]:
population

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

Let’s Divide and see what happens

In [69]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

Any item for which one or the other does not have an entry is marked by NaN, or “Not a Number”, which is how Pandas marks missing data

In [70]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])

In [71]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [72]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Dataframe

In [73]:
data3=[[3,4], [5,6]]
data4=[[1,5,5], [3,9,8], [8,3,4]]

In [74]:
A = pd.DataFrame(data3, columns=list('AB'))
A

   A  B
0  3  4
1  5  6

In [75]:
B = pd.DataFrame(data4, columns=list('BAC'))
B

   B  A  C
0  1  5  5
1  3  9  8
2  8  3  4

In [76]:
A + B

      A    B   C
0   8.0  5.0 NaN
1  14.0  9.0 NaN
2   NaN  NaN NaN

In [77]:
np.mean(A.values)

4.5

In [78]:
A.add(B, fill_value=np.mean(A.values))

      A     B     C
0   8.0   5.0   9.5
1  14.0   9.0  12.5
2   7.5  12.5   8.5

### Missing Data

Let’s show a few convenient methods to deal with Missing Data in pandas:

The first sentinel value used by Pandas is None, a Python singleton object that is often used for missing data in Python code. Because it is a Python object, None cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type ’object’ (i.e., arrays of Python objects):

Dropping

In [79]:
df = pd.DataFrame({
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1, 2, 3]
})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [81]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [82]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [83]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [84]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

### Filling

In [85]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [86]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

## Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

In [87]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']},
index=[0, 1, 2, 3])
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']},
index=[4, 5, 6, 7])
df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']},
index=[8, 9, 10, 11])

### 1.1 Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [88]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [89]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### 1.2 Example DataFrames

In [90]:
left = pd.DataFrame({
    'key': ['K00', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
right = pd.DataFrame({
    'key': ['K01', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [91]:
left

   key   A   B
0  K00  A0  B0
1   K1  A1  B1
2   K2  A2  B2
3   K3  A3  B3

In [92]:
right

   key   C   D
0  K01  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

### 1.3 Merging

The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [93]:
 pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [94]:
 pd.merge(left, right, how='outer', on='key')

   key    A    B    C    D
0  K00   A0   B0  NaN  NaN
1   K1   A1   B1   C1   D1
2   K2   A2   B2   C2   D2
3   K3   A3   B3   C3   D3
4  K01  NaN  NaN   C0   D0

Or to show a more complicated example:

In [95]:
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
})
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

In [96]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [97]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [98]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [99]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [100]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [101]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### 1.4 Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [102]:
left = pd.DataFrame({ 
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']},
index=['K0', 'K1', 'K2'])
right = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']},
index=['K0', 'K2', 'K3'])

In [103]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [104]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [105]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [106]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### 2 Appending

In [107]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [108]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('BA'))
df2

   B  A
0  5  6
1  7  8

In [109]:
df.append(df2)

C:\Users\user\AppData\Local\Temp\ipykernel_19144\2094904254.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)

   A  B
0  1  2
1  3  4
0  6  5
1  8  7

In [110]:
pd.concat([df, df2])

   A  B
0  1  2
1  3  4
0  6  5
1  8  7

In [111]:
df.append(df2, ignore_index=True)

C:\Users\user\AppData\Local\Temp\ipykernel_19144\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

   A  B
0  1  2
1  3  4
2  6  5
3  8  7